app/Controllers/Buku.php

    public function index()
    {
        $data = [
            'title' => 'Daftar Buku',
            'buku' => $this->bukuModel->findAll()
---
SELECT *
FROM `buku`