app/Controllers/Pegawai.php

    public function index()
    {
        $currentPage = $this->request->getVar('page_pegawai') ? $this->request->getVar('page_pegawai') : 1;

        $keyword = $this->request->getVar('keyword');
        if ($keyword) {
            $pegawai = $this->pegawai->search($keyword);
        } else {
            $pegawai = $this->pegawai;
        }

        $data = [
            'title' => 'Daftar Pegawai',
            'pegawai' => $pegawai->paginate(5, 'pegawai'),
---
SELECT *
FROM `pegawai`
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `pegawai`